from bot.loader import main_menu_buttons

welcome = '''Добро пожаловать!

Наш салон красоты — это место, где вы можете полностью расслабиться и насладиться высококачественными услугами.
У нас работают только опытные специалисты, которые используют только самые современные технологии и инструменты для достижения наилучших результатов.
Мы предлагаем широкий спектр услуг, включая стрижку, окрашивание, уход за волосами и ногтями, макияж и многое другое.
Наша команда всегда готова пойти на встречу вашим потребностям и сделать все возможное, чтобы вы остались довольны результатом.
Посетите наш салон красоты уже сегодня и позвольте нам позаботиться о вашей красоте и здоровье!'''

get_phone_text = 'Отлично! Теперь укажите пожалуйста Ваш номер телефона, либо нажмите на кнопку ниже для передачи номера.'

about_bot = f'''<b>Мы рады видеть Вас в нашем салоне красоты :-)</b>

{main_menu_buttons[0]} - В профиле можно изменить информацию о себе
{main_menu_buttons[1]} - Вы можете записаться на услуги в нашем салоне
{main_menu_buttons[2]} - Посмотреть предыдущие и предстоящие записи к мастерам
{main_menu_buttons[3]} - Информация о нашем салоне
'''
