from bot.loader import main_menu_buttons

welcome = '''Салон красоты "Ваниль" - это уютное место, где каждая женщина сможет найти свою индивидуальность и подчеркнуть ее с помощью профессиональных услуг и ухода за внешностью.
Наш салон предлагает полный спектр услуг, направленных на создание и поддержание красоты.
Мы предлагаем услуги окрашивания волос, работая с самыми качественными красками и техниками, чтобы достичь идеального цвета и оттенка волос.
Профессиональный массаж, уход за лицом и телом, маникюр и педикюр – мы предлагаем все, чтобы вы почувствовали себя особенной и неповторимой.
Мы понимаем, что красота – это не только внешний вид, но и самочувствие. Поэтому в "Ваниль" вы сможете получить консультацию опытных специалистов по уходу за кожей и волосами. Мы подберем подходящие косметические средства и процедуры, чтобы вы сияли красотой изнутри.

Наш адрес: <a href="https://yandex.ru/maps/-/CDq~46JX">Москва, ул.Удальцова, д.30, 1 этаж</a>
'''

get_phone_text = 'Отлично! Теперь укажите пожалуйста Ваш номер телефона, либо нажмите на кнопку ниже для передачи номера.'

about_bot = f'''<b>Мы рады видеть Вас в нашем салоне красоты :-)</b>

{main_menu_buttons[0]} - В профиле можно изменить информацию о себе
{main_menu_buttons[1]} - Вы можете записаться на услуги в нашем салоне
{main_menu_buttons[2]} - Посмотреть предыдущие и предстоящие записи к мастерам
{main_menu_buttons[3]} - Информация о нашем салоне
'''
